---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyRotateTextWithComponent
source: html/5eb284e0-0bad-d096-0ca1-723b28392a3b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyRotateTextWithComponent Property

"Rotate text with component"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyRotateTextWithComponent { get; }
```